Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.repositoryInsights.reason.promptPlaceholderMissing
source: The current Generator prompt does not include {repositoryInsightsSection}
zh_hans: 当前 Generator 提示词缺少 {repositoryInsightsSection}

# rag.workspace.repositoryInsights.repository
source: Repository
zh_hans: 仓库

# rag.workspace.repositoryInsights.sourceHash
source: Source hash
zh_hans: 数据哈希

# rag.workspace.repositoryInsights.status
source: Status
zh_hans: 状态

# rag.workspace.repositoryInsights.status.degraded
source: Degraded
zh_hans: 已降级

# rag.workspace.repositoryInsights.status.notInjected
source: Not injected
zh_hans: 未注入

# rag.workspace.repositoryInsights.status.success
source: Available
zh_hans: 可用

# rag.workspace.repositoryInsights.status.unavailable
source: Unavailable
zh_hans: 不可用

# rag.workspace.repositoryInsights.tokens
source: Tokens sent
zh_hans: 发送 Token

# rag.workspace.repositoryInsights.xml
source: Repository insights XML
zh_hans: 仓库洞察 XML

# rag.workspace.repositoryInsights.xml.expand
source: View full repository insights XML
zh_hans: 查看完整仓库洞察 XML

# rag.workspace.repositoryInsights.xmlHash
source: XML hash
zh_hans: XML 哈希

# rag.cli.error.directOnly
source: CLI inference is available only in the Direct build.
zh_hans: CLI 推理仅在 Direct 版本中可用。

# rag.cli.error.executableNotFoundFormat
source: %@ was not found. Install and sign in to the CLI first.
zh_hans: 未找到 %@，请先安装并登录该 CLI。

# rag.cli.error.invalidHistory
source: The RAG history contains unsupported tool messages.
zh_hans: RAG 历史中包含 CLI 不支持的工具消息。

# rag.cli.error.invalidOutput
source: The CLI returned an invalid response.
zh_hans: CLI 返回了无效响应。

# rag.cli.error.launchFailed
source: The CLI process could not be started.
zh_hans: 无法启动 CLI 进程。

# rag.cli.error.processFailed
source: CLI inference failed. Check the installation and login status.
zh_hans: CLI 推理失败，请检查安装和登录状态。

# rag.cli.error.prohibitedTool
source: The CLI attempted to use a prohibited tool, so the request was stopped.
zh_hans: CLI 尝试调用已禁用的工具，本次请求已停止。

# rag.cli.error.timedOut
source: CLI inference timed out.
zh_hans: CLI 推理超时。

# rag.cli.error.unsupportedImages
source: Image attachments are not supported by the CLI inference backend yet.
zh_hans: CLI 推理后端暂不支持图片附件。

# rag.workspace.inference.backend.api.hint
source: Uses the API model selected in the RAG composer.
zh_hans: 使用 RAG 输入区中选择的 API 模型。

# rag.workspace.inference.backend.claude.hint
source: Uses the local Claude Code login in text-only safe mode. Direct only.
zh_hans: 复用本机 Claude Code 登录，并以纯文本安全模式运行。仅限 Direct 版。

# rag.workspace.inference.backend.codex.hint
source: Uses the local Codex login with user tools and configuration disabled. Direct only.
zh_hans: 复用本机 Codex 登录，并禁用用户工具和配置。仅限 Direct 版。

# rag.workspace.inference.backend.title
source: Text Inference Backend
zh_hans: 文本推理后端

# rag.workspace.inference.backend.summary
source: Choose an API Provider or an installed and signed-in local CLI. The CLI is used only for RAG text inference.
zh_hans: 选择 API Provider，或使用本机已安装并登录的 CLI。CLI 仅用于 RAG 文本推理。

# rag.workspace.inference.boundary.otherFeatures
source: README translation, notes, summaries, and other AI features continue using API Providers.
zh_hans: README 翻译、笔记、摘要和其它 AI 功能继续使用 API Provider。

# rag.workspace.inference.boundary.retrieval
source: Starcat still performs retrieval, Embedding, Rerank, and citation validation.
zh_hans: 检索、Embedding、Rerank 和引用校验仍由 Starcat 执行。

# rag.workspace.inference.boundary.title
source: Execution Boundary
zh_hans: 执行边界

# rag.workspace.inference.boundary.tools
source: CLI tools, Shell, file access, MCP, browser, and subagents are disabled.
zh_hans: CLI 的 Tool、Shell、文件访问、MCP、浏览器和子 Agent 均被禁用。

# rag.workspace.inference.installGuide
source: Install Guide
zh_hans: 安装说明

# rag.workspace.inference.loginNotice
source: Detection verifies only the executable and version. Sign in from Terminal first; authentication is verified by the first RAG request.
zh_hans: 状态检测只验证可执行文件和版本。请先在终端完成登录，真实鉴权会在首次 RAG 问答时验证。

# rag.workspace.inference.refresh.help
source: Detect Codex and Claude Code again
zh_hans: 重新检测 Codex 和 Claude Code

# rag.workspace.inference.refresh.label
source: Detect local CLI runtimes
zh_hans: 检测本机 CLI 运行环境

# rag.workspace.inference.status.builtIn
source: Built-in
zh_hans: 内置

# rag.workspace.inference.status.checking
source: Checking
zh_hans: 检测中

# rag.workspace.inference.status.checkingDetail
source: Checking the executable and version…
zh_hans: 正在检查可执行文件和版本…

# rag.workspace.inference.status.failed
source: Check Failed
zh_hans: 检测失败

# rag.workspace.inference.status.failedDetail
source: The executable exists, but its version could not be read. Check its permissions or installation.
zh_hans: 可执行文件存在，但无法读取版本。请检查权限或安装状态。

# rag.workspace.inference.status.notInstalled
source: Not Installed
zh_hans: 未安装

# rag.workspace.inference.status.notInstalledDetail
source: No executable was found. Install and sign in, then detect again.
zh_hans: 未找到可执行文件。安装并登录后重新检测。

# rag.workspace.inference.status.ready
source: Available
zh_hans: 可用

# rag.workspace.inference.status.selectedUnavailable
source: This backend is selected but unavailable. Starcat will not switch to the API automatically.
zh_hans: 当前后端已选中但不可用；Starcat 不会自动切换到 API。

# rag.workspace.settings.section.inference
source: Inference
zh_hans: 推理

# readme.find.close
source: Close Find
zh_hans: 关闭查找
zh_hant: 關閉尋找

# readme.find.next
source: Find Next
zh_hans: 查找下一个
zh_hant: 尋找下一個

# readme.find.noMatch
source: No matches
zh_hans: 无匹配
zh_hant: 無符合項目

# readme.find.placeholder
source: Find
zh_hans: 查找
zh_hant: 尋找

# readme.find.previous
source: Find Previous
zh_hans: 查找上一个
zh_hant: 尋找上一個

# releases.download.openFolder
source: Open
zh_hans: 打开

# releases.download.savedToFormat
source: Saved to %@
zh_hans: 已保存到 %@

# repo.hero.copyName
source: Copy repository name
zh_hans: 复制仓库名

# repo.owner.card.help
source: View owner
zh_hans: 查看所有者

# repo.owner.follow
source: Follow
zh_hans: 关注

# repo.owner.followers
source: Followers
zh_hans: 关注者

# repo.owner.following
source: Following
zh_hans: 关注中

# repo.owner.followingBadge
source: Following
zh_hans: 已关注

# repo.owner.stat.help
source: View on GitHub
zh_hans: 在 GitHub 查看

# repo.owner.unfollow
source: Unfollow
zh_hans: 取消关注

# search.semantic.indexingProgressFormat
source: Refreshing semantic index %d/%d
zh_hans: 正在刷新语义索引 %d/%d

# search.semantic.querying
source: Searching semantically...
zh_hans: 正在语义搜索...

# settings.activity.issueEvents.help
source: Insert label changes, closes, commit references, and related PRs between comments. Comments only by default.
zh_hans: 在评论之间插入加标签、关闭、commit 引用、关联 PR 等 GitHub 事件。默认只显示评论。
zh_hant: 在評論之間插入加標籤、關閉、commit 引用、關聯 PR 等 GitHub 事件。預設只顯示評論。

# settings.activity.issueEvents.title
source: Show issue events
zh_hans: 显示 Issue 事件
zh_hant: 顯示 Issue 事件

# settings.activity.section
source: Activity
zh_hans: 活动
zh_hant: 活動

# settings.ai.prompt.placeholder.insightsContext
source: Shared Repository Insights snapshot (activity, contributors, health, release cadence, and Star history; empty when unavailable).
zh_hans: 共享的仓库洞察快照（活动、贡献者、健康度、发布节奏与 Star 历史；不可用时为空）。

# settings.aiIndex.prefetch.lastRunFormat
source: Last prefetch: %@ · %@
zh_hans: 上次预拉：%@ · %@

# settings.aiIndex.prefetch.neverRun
source: No prefetch yet
zh_hans: 尚未预拉

# settings.autoTidy.actions.githubListGrouping
source: Automatically add to repository groups
zh_hans: 自动添加到仓库分组
zh_hant: 自動加入倉庫分組

# settings.autoTidy.actions.githubListGrouping.description
source: Writes memberships to GitHub in the background only when the target List also enables auto-grouping. This is off by default.
zh_hans: 仅当目标分组也开启自动整理时，才会在后台向 GitHub 写入分组关系。此功能默认关闭。
zh_hant: 僅當目標分組也開啟自動整理時，才會在背景向 GitHub 寫入分組關係。此功能預設關閉。

# settings.externalSearch.firecrawl.fullText
source: Fetch full-page markdown
zh_hans: 获取全文 markdown

# settings.general.dataContribution.help
source: After a successful full Stars sync, Starcat silently contributes public repository IDs and Star times to improve recommendations. Private repositories, tags, notes, and browsing activity are never uploaded.
zh_hans: 成功完成 Stars 全量同步后，Starcat 会静默贡献公开仓库 ID 和 Star 时间，用于改进推荐。不会上传私有仓库、标签、笔记或浏览行为。

# settings.general.dataContribution.section
source: Privacy & Recommendations
zh_hans: 隐私与推荐

# settings.general.dataContribution.title
source: Anonymously contribute public Star data
zh_hans: 匿名贡献公开 Star 数据

# settings.general.oauthScopes.notifications
source: Read and manage GitHub notifications.
zh_hans: 读取和管理 GitHub 通知。

# settings.general.oauthScopes.organizationHelp
source: Organization owners may restrict third-party OAuth app access. These scopes do not bypass an organization authorization policy.
zh_hans: 组织所有者可能限制第三方 OAuth App 访问；这些权限无法绕过组织授权策略。

# settings.general.oauthScopes.publicRepo
source: Read and manage public repository data.
zh_hans: 读取和管理公开仓库数据。

# settings.general.oauthScopes.readUser
source: Read GitHub profile data.
zh_hans: 读取 GitHub 个人资料。

# settings.general.oauthScopes.section
source: GitHub OAuth Permissions
zh_hans: GitHub OAuth 权限

# settings.general.oauthScopes.summary
source: Starcat requests the following OAuth scopes during GitHub sign-in.
zh_hans: Starcat 登录 GitHub 时会申请以下 OAuth 权限。

# settings.general.oauthScopes.unknown
source: Requested by the current app version.
zh_hans: 由当前 App 版本申请。

# settings.general.oauthScopes.user
source: Read and update GitHub user account data.
zh_hans: 读取和更新 GitHub 用户账户数据。

# settings.general.openRepositoryMarkdownInApp.help
source: When enabled, Markdown links to this repository in the README open in a separate window. ⌘-click always uses the browser.
zh_hans: 开启后，README 里指向本仓库的 Markdown 链接会在独立窗口打开。⌘-点击始终用浏览器。
zh_hant: 開啟後，README 裡指向本倉庫的 Markdown 連結會在獨立視窗開啟。⌘-點擊一律使用瀏覽器。

# settings.general.openRepositoryMarkdownInApp.title
source: Open repository docs in the app
zh_hans: 应用内打开仓库文档
zh_hant: 應用程式內開啟倉庫文件

# settings.general.shortcuts.readmeFind.help
source: Click to record a new README search shortcut
zh_hans: 点击录制新的 README 搜索快捷键

# settings.general.shortcuts.readmeFind.title
source: README Search
zh_hans: README 搜索

# settings.general.spotlightSearch.help
source: Indexes all starred repositories, including private repository names and your notes, on this Mac. This content may appear in macOS Spotlight results. Turning this off removes the Starcat Spotlight index.
zh_hans: 在这台 Mac 上索引全部已 Star 仓库，包括私有仓库名称和你的笔记；这些内容可能出现在 macOS Spotlight 结果中。关闭后会删除 Starcat 的 Spotlight 索引。
zh_hant: 在這台 Mac 上索引全部已加星號的倉庫，包括私有倉庫名稱和你的筆記；這些內容可能出現在 macOS Spotlight 結果中。關閉後會刪除 Starcat 的 Spotlight 索引。

# settings.general.spotlightSearch.title
source: Search Starcat repositories with Spotlight
zh_hans: 使用 Spotlight 搜索 Starcat 仓库
zh_hant: 使用 Spotlight 搜尋 Starcat 倉庫

# settings.integration.agentRuntime.chooseCordisConfig
source: Choose Cordis Config
zh_hans: 选择 Cordis 配置

# settings.integration.agentRuntime.chooseExecutable
source: Choose Executable
zh_hans: 选择可执行文件

# settings.integration.agentRuntime.codex.description
source: Uses your local Codex CLI and its existing authentication. Starcat never copies Codex credentials.
zh_hans: 使用本机 Codex CLI 及其已有认证；Starcat 不会复制 Codex 凭据。

# settings.integration.agentRuntime.codex.directoryOpenPanel.title
source: Choose the Codex Runtime directory
zh_hans: 选择 Codex Runtime 目录

# settings.integration.agentRuntime.codex.error.codeModeHostNotFound
source: Code Mode host is missing or not executable: %@. Install the complete Codex Runtime package.
zh_hans: Code Mode Host 缺失或不可执行：%@。请安装完整的 Codex Runtime 包。

# settings.integration.agentRuntime.codex.error.directoryNotFound
source: Codex Runtime directory does not exist: %@.
zh_hans: Codex Runtime 目录不存在：%@。

# settings.integration.agentRuntime.codex.error.runtimeNotFound
source: No runnable codex-app-server or codex was found in %@ or its bin directory.
zh_hans: 在 %@ 或其 bin 子目录中未找到可执行的 codex-app-server 或 codex。

# settings.integration.agentRuntime.codex.info.note
source: Starcat stores only the directory path and reuses Codex authentication. A standalone App Server or selected CLI directory must include an executable codex-code-mode-host.
zh_hans: Starcat 只保存目录路径并沿用 Codex 认证。独立 App Server 或所选 CLI 目录必须包含可执行的 codex-code-mode-host。

# settings.integration.agentRuntime.codex.info.summary
source: Choose a complete Codex Runtime directory. Binaries may be placed directly in the directory or in the bin subdirectory of the official package.
zh_hans: 请选择完整的 Codex Runtime 目录。二进制文件可直接位于该目录，或位于官方包根目录的 bin 子目录。

# settings.integration.agentRuntime.deepSeek.info.note
source: Keep the three carrier files in one directory. At least one verified provider is also required in AI Service settings.
zh_hans: 三个 carrier 文件必须位于同一目录；同时还需在 AI 服务设置中配置至少一个已验证服务商。

# settings.integration.agentRuntime.deepSeek.info.summary
source: DeepSeek Harness keeps separate selectors for the carrier executable and the restricted Cordis configuration.
zh_hans: DeepSeek Harness 继续分别选择 carrier 可执行文件与受限 Cordis 配置。

# settings.integration.agentRuntime.info.button
source: Runtime requirements
zh_hans: Runtime 配置说明

# settings.integration.agentRuntime.info.requiredComponents
source: Required components
zh_hans: 必要组件

# settings.integration.agentRuntime.codex.executableAvailable
source: Executable found. Confirm authentication with codex login status.
zh_hans: 已找到可执行文件；请用 codex login status 确认认证状态。

# settings.integration.agentRuntime.codex.openPanel.title
source: Choose the Codex executable
zh_hans: 选择 Codex 可执行文件

# settings.integration.agentRuntime.codex.runtimeDescription
source: Uses either your local Codex CLI or a standalone Codex App Server and its existing authentication. Starcat never copies Codex credentials.
zh_hans: 支持使用本机 Codex CLI 或独立 Codex App Server，并沿用其已有认证；Starcat 不会复制 Codex 凭据。

# settings.integration.agentRuntime.cordisConfig
source: Cordis Config
zh_hans: Cordis 配置

# settings.integration.agentRuntime.deepSeek.configurationReady
source: Carrier, Cordis config, and verified AI Provider are ready.
zh_hans: Carrier、Cordis 配置和已验证 AI Provider 均已就绪。

# settings.integration.agentRuntime.deepSeek.cordisOpenPanel.title
source: Choose the Starcat Cordis configuration
zh_hans: 选择 Starcat Cordis 配置

# settings.integration.agentRuntime.deepSeek.description
source: Requires the macOS arm64 carrier, Starcat's restricted Cordis config, and a verified AI Provider.
zh_hans: 需要 macOS arm64 carrier、Starcat 受限 Cordis 配置及已验证的 AI Provider。

# settings.integration.agentRuntime.deepSeek.openPanel.title
source: Choose the DeepSeek Harness executable
zh_hans: 选择 DeepSeek Harness 可执行文件

# settings.integration.agentRuntime.description
source: External runtimes are available in Starcat Direct only. Configure local executables here, then choose a Runtime in Agent Workspace.
zh_hans: 外部 Runtime 仅适用于 Starcat Direct。在此配置本地可执行文件，然后在 Agent 工作台选择 Runtime。

# settings.integration.agentRuntime.detectAgain
source: Detect Again
zh_hans: 重新检测

# settings.integration.agentRuntime.detecting
source: Checking local configuration…
zh_hans: 正在检查本地配置…

# settings.integration.agentRuntime.executable
source: Executable
zh_hans: 可执行文件

# settings.integration.agentRuntime.guide.notice
source: Setup, authentication, and troubleshooting are in the runtime guide.
zh_hans: 安装、认证和故障排查步骤见配置指南。

# settings.integration.agentRuntime.notConfigured
source: Not configured
zh_hans: 尚未配置

# settings.integration.agentRuntime.openGuide
source: Setup and Troubleshooting Guide
zh_hans: 配置与故障排查指南

# settings.integration.agentRuntime.openGuide.action
source: Open Guide
zh_hans: 打开指南

# settings.integration.agentRuntime.openPanel.prompt
source: Choose
zh_hans: 选择

# settings.integration.agentRuntime.restoreAutomatic
source: Use Automatic Detection
zh_hans: 恢复自动检测

# settings.integration.agentRuntime.status.ready
source: Ready
zh_hans: 就绪

# settings.integration.codebaseMemory.executable.choose
source: Choose File
zh_hans: 选择文件

# settings.integration.codebaseMemory.executable.detectAgain
source: Detect Again
zh_hans: 重新检测

# settings.integration.codebaseMemory.executable.detecting
source: Detecting executable…
zh_hans: 正在检测可执行文件…

# settings.integration.codebaseMemory.executable.install
source: Installation Instructions
zh_hans: 安装说明

# settings.integration.codebaseMemory.executable.label
source: Executable
zh_hans: 可执行文件

# settings.integration.codebaseMemory.executable.notFound
source: No compatible executable found
zh_hans: 未找到兼容的可执行文件

# settings.integration.codebaseMemory.executable.openPanel.prompt
source: Choose
zh_hans: 选择

# settings.integration.codebaseMemory.executable.openPanel.title
source: Choose the CodebaseMemory executable
zh_hans: 选择 CodebaseMemory 可执行文件

# settings.integration.codebaseMemory.executable.restoreAutomatic
source: Use Automatic Detection
zh_hans: 恢复自动检测

# settings.integration.codebaseMemory.executable.source.automatic
source: Automatically detected
zh_hans: 自动检测

# settings.integration.codebaseMemory.executable.source.bundled
source: Bundled with Starcat
zh_hans: Starcat 内置

# settings.integration.codebaseMemory.executable.source.userSelected
source: User selected
zh_hans: 用户选择

# settings.githubListGrouping.enabled.description
source: Analyze ungrouped starred repositories in the background and add only high-confidence matches to permitted groups.
zh_hans: 在后台分析未分组的仓库，仅将高置信度结果添加到已授权的分组。
zh_hant: 在背景分析未分組的倉庫，僅將高置信度結果加入已授權的分組。

# settings.githubListGrouping.enabled.title
source: Enable AI auto-grouping
zh_hans: 启用 AI 自动分组
zh_hant: 啟用 AI 自動分組

# settings.githubListGrouping.footer
source: Each group must also allow background auto-grouping in its editor before AI can add repositories to it.
zh_hans: 每个分组还需要在分组编辑器中允许后台自动分组，AI 才能向其中添加仓库。
zh_hant: 每個分組還需要在分組編輯器中允許背景自動分組，AI 才能向其中加入倉庫。

# settings.githubListGrouping.range.maxPerRun.description
source: Maximum number of ungrouped repositories to process per run (5–500).
zh_hans: 每轮最多处理的未分组仓库数量，范围 5–500。
zh_hant: 每輪最多處理的未分組倉庫數量，範圍 5–500。

# settings.githubListGrouping.range.sortOrder.description
source: Choose whether each run prefers recently starred, earliest starred, or random repositories.
zh_hans: 决定每轮优先处理最近、最早或随机选择的仓库。
zh_hant: 決定每輪優先處理最近、最早或隨機選擇的倉庫。

# settings.githubListGrouping.section
source: Repository Grouping
zh_hans: 仓库分组
zh_hant: 倉庫分組

# settings.githubListGrouping.threshold.hintFormat
source: Only suggestions at or above %@ are applied automatically.
zh_hans: 仅自动应用置信度达到 %@ 的建议。
zh_hant: 僅自動套用置信度達到 %@ 的建議。

# settings.githubListGrouping.threshold.label
source: Minimum confidence
zh_hans: 最低置信度
zh_hant: 最低置信度

# settings.githubListGrouping.trigger.onLaunch.description
source: After the app launches, wait 60 seconds and group one batch of ungrouped starred repositories.
zh_hans: 应用启动 60 秒后，自动整理一轮未分组的仓库。
zh_hant: 應用啟動 60 秒後，自動整理一輪未分組的倉庫。

# settings.githubListGrouping.trigger.onSync.description
source: After Stars sync finishes, group currently ungrouped starred repositories.
zh_hans: Stars 同步完成后，自动整理当前未分组的仓库。
zh_hant: Stars 同步完成後，自動整理當前未分組的倉庫。

# settings.notifications.githubInbox.title
source: GitHub notifications
zh_hans: GitHub 通知
zh_hant: GitHub 通知

# settings.services.history.description
source: Provides star growth history and trend data for repository insights.
zh_hans: 为仓库洞察提供 Star 增长历史与趋势数据。

# settings.services.history.title
source: Star History API
zh_hans: Star 历史 API

# settings.services.url
source: URL
zh_hans: 地址
zh_hant: 網址

# settings.sidebar.group.basic
source: Basics
zh_hans: 基础

# settings.sidebar.group.intelligence
source: Intelligence & Connections
zh_hans: 智能与连接

# settings.sidebar.group.maintenance
source: Data & Maintenance
zh_hans: 数据与维护

# settings.navigation.back
source: Back
zh_hans: 后退

# settings.navigation.forward
source: Forward
zh_hans: 前进

# settings.sidebar.search.noResults
source: No matching settings
zh_hans: 未找到相关设置

# settings.sidebar.search.placeholder
source: Search Settings
zh_hans: 搜索设置

# settings.storage.cacheOverview.empty
source: No cache yet
zh_hans: 暂无缓存

# settings.storage.cacheOverview.footer
source: These caches can be rebuilt. Clearing them does not delete your stars, tags, or notes.
zh_hans: 这些缓存可重新生成。清理不会删除你的 Stars、标签或笔记。

# settings.storage.cacheOverview.group.ai
source: AI & Knowledge
zh_hans: AI 与知识库

# settings.storage.cacheOverview.group.code
source: Code tools
zh_hans: 代码工具

# settings.storage.cacheOverview.group.content
source: Content
zh_hans: 内容缓存

# settings.storage.cacheOverview.group.discovery
source: Search & Wiki
zh_hans: 搜索与 Wiki

# settings.storage.cacheOverview.title
source: Cache usage
zh_hans: 缓存用量

# settings.storage.cacheOverview.totalFormat
source: %@ total
zh_hans: 共 %@

# settings.storage.clearIssueTimeline.confirm
source: Clear Issue event cache?
zh_hans: 清除 Issue 事件流缓存？
zh_hant: 清除 Issue 事件流快取？

# settings.storage.clearIssueTimeline.message
source: The next time you open that Issue, Starcat will fetch comments and events from GitHub again.
zh_hans: 下次打开对应 Issue 时会重新向 GitHub 拉取评论和事件。
zh_hant: 下次打開對應 Issue 時會重新向 GitHub 拉取評論和事件。

# settings.storage.clearIssueCommentDraft.confirm
source: Clear Issue comment drafts?
zh_hans: 清除 Issue 评论草稿？
zh_hant: 清除 Issue 評論草稿？

# settings.storage.clearIssueCommentDraft.message
source: Unsent comment drafts saved on this Mac will be removed. Comments already posted to GitHub are not affected.
zh_hans: 将删除本机保存的未提交评论草稿。已经发到 GitHub 的评论不受影响。
zh_hant: 將刪除此裝置上儲存的未提交評論草稿。已發到 GitHub 的評論不受影響。

# settings.storage.issueTimeline
source: Issue event cache
zh_hans: Issue 事件流缓存
zh_hant: Issue 事件流快取

# settings.storage.issueTimeline.help
source: Issue comments and events from notification details. Still available locally after you quit the app.
zh_hans: 通知详情里的 Issue 评论和事件。关掉 App 后仍可先读本地。
zh_hant: 通知詳情裡的 Issue 評論和事件。關掉 App 後仍可先讀本地。

# settings.storage.issueCommentDraft
source: Issue comment drafts
zh_hans: Issue 评论草稿
zh_hant: Issue 評論草稿

# settings.storage.issueCommentDraft.help
source: Unsent Issue / PR comment drafts, including AI replies. Still available after you quit or switch threads.
zh_hans: 未提交的 Issue / PR 评论草稿，包括 AI 回复。关掉 App 或切换帖子后仍保留。
zh_hant: 未提交的 Issue / PR 評論草稿，包括 AI 回覆。關閉 App 或切換討論串後仍保留。

# sharecard.export.includeAttribution
source: Include Starcat GitHub link
zh_hans: 包含 Starcat GitHub 链接

# sidebar.background.manual.pendingReviewFormat
source: %lld repositories pending tag review
zh_hans: %lld 个仓库的标签待确认

# spotlight.repository.entity.type
source: Repository
zh_hans: 仓库
zh_hant: 倉庫

# spotlight.repository.open.target
source: Repository
zh_hans: 仓库
zh_hant: 倉庫

# spotlight.repository.open.title
source: Open Repository
zh_hans: 打开仓库
zh_hant: 開啟倉庫

# spotlight.repository.property.name
source: Name
zh_hans: 名称
zh_hant: 名稱

# spotlight.repository.property.owner
source: Owner
zh_hans: 所有者
zh_hant: 擁有者

# spotlight.repository.property.repositoryID
source: Repository ID
zh_hans: 仓库 ID
zh_hant: 倉庫 ID

# tagManagement.mergeSheetSubtitle
source: Choose which tag to keep
zh_hans: 选择要保留的目标标签

# tagManagement.mergeSheetTitle
source: Merge Tags
zh_hans: 合并标签

# tagManagement.mergeSheetHint
source: Choose which tag to keep. The other selected tags will be merged into it. This cannot be undone.
zh_hans: 选择要保留的目标标签；其余选中标签将并入该标签，此操作不可撤销。

# tagManagement.newTagNamePlaceholder
source: Name this tag
zh_hans: 为标签命名

# toolbar.status.github.checking
source: Checking GitHub's official status...
zh_hans: 正在获取 GitHub 官方状态...

# toolbar.status.github.open
source: View Status
zh_hans: 查看状态

# toolbar.status.github.staleFormat
source: %@ · latest refresh failed
zh_hans: %@ · 最近一次更新失败

# toolbar.status.github.state.degraded
source: API Requests performance degraded
zh_hans: API Requests 性能下降

# toolbar.status.github.state.maintenance
source: API Requests under maintenance
zh_hans: API Requests 维护中

# toolbar.status.github.state.majorOutage
source: API Requests major outage
zh_hans: API Requests 严重中断
